{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 145], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "cu_dnnlstm_2", "class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "time_major": false, "units": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "cu_dnnlstm_3", "class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "time_major": false, "units": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cu_dnnlstm_2", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["cu_dnnlstm_3", 0, 0, {}]]]}, {"name": "pitch_out", "class_name": "Dense", "config": {"name": "pitch_out", "trainable": true, "dtype": "float32", "units": 37, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "duration_out", "class_name": "Dense", "config": {"name": "duration_out", "trainable": true, "dtype": "float32", "units": 48, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["pitch_out", 0, 0], ["duration_out", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}, "loss": {"pitch_out": "sparse_categorical_crossentropy", "duration_out": "sparse_categorical_crossentropy"}, "metrics": {"pitch_out": "acc", "duration_out": "acc"}, "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "cu_dnnlstm_2/kernel", "shape": [145, 256], "dtype": "float32"}, {"name": "cu_dnnlstm_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "cu_dnnlstm_2/bias", "shape": [512], "dtype": "float32"}, {"name": "cu_dnnlstm_3/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "cu_dnnlstm_3/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "cu_dnnlstm_3/bias", "shape": [512], "dtype": "float32"}, {"name": "duration_out/kernel", "shape": [64, 48], "dtype": "float32"}, {"name": "duration_out/bias", "shape": [48], "dtype": "float32"}, {"name": "pitch_out/kernel", "shape": [64, 37], "dtype": "float32"}, {"name": "pitch_out/bias", "shape": [37], "dtype": "float32"}]}]}